Revit 2027 API
ElectricalDemandFactorDefinition Constructor
 Constructs a new ElectricalDemandFactorDefinition with default settings.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElectricalDemandFactorDefinition()
Public Sub New
public:
ElectricalDemandFactorDefinition()
new : unit -> ElectricalDemandFactorDefinition
See Also
Reference
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace